In [1]:
import numpy as np
import pandas as pd

In [2]:
dates = pd.date_range('20130101', periods=6)

In [3]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [38]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [5]:
df

                   A         B         C         D
2013-01-01 -0.375173 -1.759237 -0.358000  0.468985
2013-01-02  1.199213  0.549543 -0.331268  0.118987
2013-01-03 -0.062807 -0.749300 -1.375357 -0.609892
2013-01-04  0.724525 -0.691858  0.912221  0.204760
2013-01-05  0.578687  0.440268  0.886053  0.099594
2013-01-06 -0.438366  2.395365  1.326080  1.734777

In [7]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.271013  0.030797  0.176622  0.336202
std    0.662435  1.439649  1.031316  0.773199
min   -0.438366 -1.759237 -1.375357 -0.609892
25%   -0.297081 -0.734940 -0.351317  0.104443
50%    0.257940 -0.125795  0.277392  0.161873
75%    0.688065  0.522224  0.905679  0.402928
max    1.199213  2.395365  1.326080  1.734777

In [8]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.375173    1.199213   -0.062807    0.724525    0.578687   -0.438366
B   -1.759237    0.549543   -0.749300   -0.691858    0.440268    2.395365
C   -0.358000   -0.331268   -1.375357    0.912221    0.886053    1.326080
D    0.468985    0.118987   -0.609892    0.204760    0.099594    1.734777

In [13]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.468985 -0.358000 -1.759237 -0.375173
2013-01-02  0.118987 -0.331268  0.549543  1.199213
2013-01-03 -0.609892 -1.375357 -0.749300 -0.062807
2013-01-04  0.204760  0.912221 -0.691858  0.724525
2013-01-05  0.099594  0.886053  0.440268  0.578687
2013-01-06  1.734777  1.326080  2.395365 -0.438366

In [17]:
df.sort_values(by='C').sort_values(by='A')

                   A         B         C         D
2013-01-06 -0.438366  2.395365  1.326080  1.734777
2013-01-01 -0.375173 -1.759237 -0.358000  0.468985
2013-01-03 -0.062807 -0.749300 -1.375357 -0.609892
2013-01-05  0.578687  0.440268  0.886053  0.099594
2013-01-04  0.724525 -0.691858  0.912221  0.204760
2013-01-02  1.199213  0.549543 -0.331268  0.118987

In [39]:
df3 = df.copy()

In [40]:
df3.iloc[0,0] = 1000

In [42]:
df3

                      A         B         C         D
2013-01-01  1000.000000  0.401789  1.097203  1.119763
2013-01-02    -0.087662 -0.503555  1.316992 -0.880294
2013-01-03     0.196646 -1.805675  0.623489 -0.116902
2013-01-04     0.239618 -0.221247  0.694727  0.060773
2013-01-05     0.941097  1.000806  0.553558 -1.425368
2013-01-06    -0.870109 -0.299531 -0.781670  1.252504

### Series.Map

In [48]:
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])

In [49]:
df = pd.DataFrame({'pet':s})

In [50]:
df['baby'] = df.pet.map({'cat':'kitten', 'dog':'puppy'})

In [54]:
df['I am'] = df.pet.map('I am a {}'.format, na_action='ignore')

In [55]:
df

      pet    baby           I am
0     cat  kitten     I am a cat
1     dog   puppy     I am a dog
2     NaN     NaN            NaN
3  rabbit     NaN  I am a rabbit

### Dataframe.Apply

In [57]:
df = pd.DataFrame([[4,9]]*3 , columns=['A','B'])

In [56]:
[[4,9]]*3

[[4, 9], [4, 9], [4, 9]]

In [58]:
df

   A  B
0  4  9
1  4  9
2  4  9

In [59]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [60]:
df.apply(np.sum)

A    12
B    27
dtype: int64

In [61]:
df.apply(np.sum, axis=0)

A    12
B    27
dtype: int64

In [63]:
df['sum'] = df.apply(np.sum, axis=1)

In [64]:
df

   A  B  sum
0  4  9   13
1  4  9   13
2  4  9   13

In [67]:
df = pd.DataFrame([[1,2.12],[3.356, 4.567]])
df

       0      1
0  1.000  2.120
1  3.356  4.567

In [70]:
df.applymap(lambda x : len(str(x)))

   0  1
0  3  4
1  5  5

In [69]:
str(1.000),str(2.120)

('1.0', '2.12')

In [72]:
df.applymap(lambda x : x**2)

           0          1
0   1.000000   4.494400
1  11.262736  20.857489

In [73]:
df ** 2

           0          1
0   1.000000   4.494400
1  11.262736  20.857489

#### Operation

In [75]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [76]:
df

                   A         B         C         D
2013-01-01 -1.165828  0.121913 -2.877856 -0.363556
2013-01-02 -2.294153  0.994329  1.715942 -0.651021
2013-01-03 -0.220442  0.641520  0.726238 -1.400801
2013-01-04 -0.846493  0.100768  0.578719 -1.024333
2013-01-05 -0.848315  0.364416  0.753247 -0.394009
2013-01-06 -0.919063  1.015568 -0.097858  0.928350

In [81]:
df.mean(1)

2013-01-01   -1.071332
2013-01-02   -0.058726
2013-01-03   -0.063371
2013-01-04   -0.297835
2013-01-05   -0.031165
2013-01-06    0.231749
Freq: D, dtype: float64

In [83]:
df.div(0.5)

                   A         B         C         D
2013-01-01 -2.331656  0.243826 -5.755711 -0.727113
2013-01-02 -4.588306  1.988657  3.431883 -1.302042
2013-01-03 -0.440884  1.283040  1.452477 -2.801601
2013-01-04 -1.692987  0.201536  1.157438 -2.048666
2013-01-05 -1.696630  0.728831  1.506495 -0.788018
2013-01-06 -1.838126  2.031136 -0.195717  1.856700

In [84]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -1.165828  0.121913 -2.877856 -0.363556
2013-01-02 -3.459981  1.116242 -1.161914 -1.014577
2013-01-03 -3.680423  1.757762 -0.435676 -2.415378
2013-01-04 -4.526917  1.858530  0.143043 -3.439711
2013-01-05 -5.375232  2.222945  0.896290 -3.833720
2013-01-06 -6.294295  3.238513  0.798432 -2.905370